notes/00-intro.md

# Table of Contents

1.  [What will we learn?](#org5734ca6)



<a id="org5734ca6"></a>

# What will we learn?

1.  How to describe light in mathematical language as electromagnetic wave in the
    classical regime &#x2014; the Maxwell&rsquo;s equations and its sollutions.
2.  How to quantize the light and why it&rsquo;s a quantum harmonic oscillator.
3.  How to visualize a quantum state in phase space with the wigner function.
4.  Several states of light in the quantum regime &#x2014; the gaussian, coherent,
    squeezed, thermal states.
5.  How to descibe an atom with a two-level model.
    1.  Bloch equations.
    2.  Rabi oscillations.
    3.  The rotating-wave approximation.
6.  How light interact with an atom in the linear regime &#x2014; the Jaynes-Cummings
    model and dressed states.
7.  How to describe light in an open optical cavity &#x2014; the open quantum theory.
    1.  The quantum Langevin equation.
    2.  The quantum master equation.
    3.  &#x2026;
8.  How to analyze the light emitted from open systems.
    1.  Photon detection.
    2.  Correlation functions.
    3.  Homodyne detection.
    4.  &#x2026;
9.  &#x2026;

